[{"id": "000095fc1d", 
    "name": "Tomato Egg Drop Soup", 
    "season": "Summer",
    "description": "Classic soup that reminds me of my childhood. I'm not the biggest fan of tomatoes and eggs, a classic Chinese combination, but this was an excellent soup.",
    "score": 3,
    "vegetarian": false,
    "vegan": false,
    "ingredients": {
        "oil": "2 tbsp", 
        "tomatoes": "10 oz", 
        "chicken stock": "1 c", 
        "water": "2 c", 
        "light soy sauce": "2 tsp", 
        "sesame oil": "1/2 tsp", 
        "white pepper": "1/4 tsp", 
        "egg": "1",
        "cornstarch": "1 1/2 tsp"
    },
    "recipe": {
        "0": "Heat the oil in a soup pot or wok over medium low heat. Add the tomato chunks and stir-fry for 5 minutes until the tomatoes are softened and start to fall apart.",
        "1": "Add in 1 cup chicken stock, 2 cups water, 2 teaspoons light soy sauce, 1/2 teaspoon sesame oil, 1/4 teaspoon ground white pepper and salt to taste. Bring to a boil, and then lower the heat so that the soup is simmering with the lid on.",
        "2": "Now quickly beat the egg in a small bowl and prepare the cornstarch slurry in a separate bowl.",
        "3": "Use a ladle to slowly swirl the soup in a whirlpool motion. Keep swirling as you pour in the cornstarch slurry until well incorporated. Now pour a thin stream of egg into the middle of the whirlpool as you slowly swirl the soup. This is how you get that pretty egg drop effect.",
        "4": "Serve hot or at room temperature. Ladle the soup into bowls and garnish with chopped scallions and cilantro, if using."
    }, 
    "recipe_length": 5, 
    "credits": "The Woks of Life",
    "url": "https://thewoksoflife.com/tomato-egg-drop-soup/#recipe"
},
{"id": "5b8cmkawq7", 
    "name": "Chinese pork bone soup recipe with tomatoes, potatoes, and corn", 
    "season": "Winter",
    "description": "The flavor combination of sweet corn, tomatoes, and hearty potatoes comes together in a red-hued soup that tastes amazing all year-round. Salt—the only seasoning in this recipe—makes the whole thing come alive. ",
    "score": 5,
    "vegetarian": false,
    "vegan": false,
    "ingredients": {
        "pork neck bones":"2 pounds",
        "vegetable oil":"2 tbsp",
        "tomato paste":"2 tbsp",
        "tomatoes": "1 pound",
        "water": "9 c",
        "corn": "1 ear",
        "potatoes": "1 pound",
        "salt": "1 1/2 tsp"
    },
    "recipe": {
        "0": "Soak the pork bones for 1 hour with enough cold water to cover them completely. Rinse 2-3 times until the water runs clear. (If substituting chicken, you can skip this step.)",
        "1": "Add the bones to a large, thick-bottomed soup pot, cover with fresh water, cover, and bring to a boil. Once boiling, let it boil for 1 minute, then drain through a colander. Rinse the pork bones clean, drain, and set aside.",
        "2": "Wash the pot and dry it thoroughly. Heat it over medium heat, and add the oil, tomato paste (if using), and the tomatoes. Cook for 5 minutes, or until the tomatoes are softened. Add the 9 cups of water, along with the pork bones and corn. Cover, increase the heat to high, and bring the soup to a boil.",
        "3": "Once boiling, reduce the heat to medium-low. Cover and simmer for 1 hour (for ribs or chicken) or 90 minutes (for neck bones).",
        "4": "Next, add the potato chunks, cover, and bring the soup to a boil once again. Reduce the heat to medium low and simmer for another 30 minutes, until potatoes are tender. Skim off the grease floating on the surface of the soup (optional), and stir in the salt. Serve the soup with salt, so that each person can add more to taste before enjoying. Serve the pork or chicken from the soup with light soy sauce for dipping."
    }, 
    "recipe_length": 5, 
    "credits": "The Woks of Life",
    "url": "https://thewoksoflife.com/chinese-pork-bone-soup-with-tomatoes-potatoes-corn/#recipe"
},
{"id": "9a6b493d95", 
    "name": "Salted Pork Bone Soup", 
    "season": "Winter",
    "description": "Homestyle comfort food recipe. The addition of glass noodles makes this an extra satisfying meal. Great for the family.",
    "score": 4,
    "vegetarian": false,
    "vegan": false,
    "ingredients": {
        "vegetable oil":"2 tbsp",
        "salted meaty pork neck bones":"2 pounds",
        "water":"8 1/2 c",
        "ginger": "3 slices",
        "vermicelli": "1.75 oz",
        "napa cabbage": "1 lb"
    },
    "recipe": {
        "0": "Heat your soup pot over high heat until it just starts to smoke. Reduce the heat to medium-high. Add 2 tablespoons of oil to evenly coat the bottom, then add the salted pork bones in a single layer. Brown the bones on all sides until light golden brown, taking care not to burn them, which will cause your soup to taste bitter.",
        "1": "While the meat is browning, boil the water in a separate pot. Once the meat is done, carefully pour the boiling water into the soup pot.",
        "2": "Increase the heat to high to quickly bring the soup to a boil. Add the ginger slices, cover, reduce the heat to medium low, and simmer for 1 ½ to 2 hours. (If using, add the soaked dried squid, conch, or dried scallops plus the liquid it soaked in along with the ginger.)",
        "3": "Soak the mung bean vermicelli or sweet potato glass noodles, submerging them in cool water so they soften as the soup cooks. They won’t need to cook for very long.",
        "4": "Wash the napa cabbage (or your leafy green of your choice). Shake off excess water, and cut the cabbage into bite-sized pieces.",
        "5": "After 1 ½ to 2 hours of cooking, add the napa cabbage. Increase the heat to high to bring the soup to a boil. Cover, reduce the heat to medium, and cook for another 5 minutes until the cabbage is tender (or if using a more tender leafy green like bok choy, cook for 1 to 2 minutes).",
        "6": "If you are using cooked rice or potato starch noodles instead of glass noodles, this is the time to add them.",
        "7": "Season with salt and white pepper to taste. Before serving, add the mung bean vermicelli, scallions, and cilantro. Bring the soup to a boil and serve."
    }, 
    "recipe_length": 8, 
    "credits": "The Woks of Life",
    "url": "https://thewoksoflife.com/chinese-salted-pork-bone-soup/#recipe"
},
{"id": "vso0dwfn2o", 
    "name": "Tomato Hot Pot with Beef", 
    "season": "Winter",
    "description": "The tart and sweet tomatoes provide the perfect contrast to the marbled, thinly sliced beef. Enoki mushrooms and mung bean vermicelli both add additional textural contrast for a warming, satisfying meal.",
    "score": 5,
    "vegetarian": false,
    "vegan": false,
    "ingredients": {
        "vermicelli":"1.75 oz",
        "enoki mushrooms":"6 oz",
        "tomatoes":"3",
        "fatty, thinly sliced hot pot beef": "12 oz",
        "scallions": "3",
        "vegetable oil": "1 1/2 tbsp",
        "ginger": "2 slices",
        "garlic": "1 clove",
        "tomato paste": "2 tbsp",
        "light soy sauce": "1 tbsp",
        "sugar": "1/2 tsp",
        "sesame oil": "1/2 tsp",
        "chicken stock": "4 cups",
        "water": "2 c",
        "white pepper": "1/8 tsp"
    },
    "recipe": {
        "0": "Place the bundle of mung bean vermicelli in a bowl of warm water to soak until softened, about 15 minutes. Trim the ends off the enoki mushrooms, and lightly rinse them of any dirt, separating them into smaller sections as you go (each bundle of mushrooms should be about 1/2 inch thick). Set the noodles and mushrooms aside.",
        "1": "Bring a medium pot of water to a boil. Use a sharp paring knife to cut an X into the bottom of each tomato, which will make it easier to peel after blanching. Carefully lower the tomatoes into the boiling water, and blanch for 30 seconds. Use a slotted spoon to remove the tomatoes from the water, and set aside to cool.",
        "2": "Bring the water back up to a boil, and add the beef. Cook for 15 seconds, or until the beef just turns opaque, and any foam rises to the surface. Remove the beef from the pot, and set aside.",
        "3": "Separate the green and white parts of the scallions. Cut the white parts on a diagonal into 1 to 2 inch pieces. Finely chop the green parts. By now, your tomatoes should be cool enough to peel. Peel the skin off, and cut into 1-inch chunks.",
        "4": "In a soup pot (preferably a Chinese ceramic soup pot if you have it!) over medium heat, add the oil, along with the white parts of the scallions and the ginger slices. Cook for 1-2 minutes, until fragrant.",
        "5": "Add the garlic and tomato paste, and cook for 30 seconds, until the oil turns a reddish-orange color. Add the tomatoes, along with the light soy sauce, sugar, and sesame oil. Fry the tomatoes until they break down a bit, about 3 minutes.",
        "6": "Add the chicken stock and water, and bring to a boil. Cover, turn the heat down, and simmer for 5 to 10 minutes. Add the enoki mushrooms and vermicelli, cover, and simmer for another 3 to 5 minutes.",
        "7": "Stir in the beef, white pepper and salt to taste. Garnish with cilantro the chopped scallion greens. Serve with steamed rice!"
    }, 
    "recipe_length": 8, 
    "credits": "The Woks of Life",
    "url": "https://thewoksoflife.com/tomato-hot-pot-beef/"
},
{"id": "9rplj8nikr", 
    "name": "Thanksgiving Turkey Congee", 
    "season": "Fall",
    "description": "Interesting use of Thanksgiving leftovers. Nothing like a warm bowl of congee.",
    "score": 3,
    "vegetarian": false,
    "vegan": false,
    "ingredients": {
        "turkey":"leftovers",
        "vegetables":"leftovers",
        "water":"14 c",
        "white rice":"1 c"
    },
    "recipe": {
        "0": "In a very large stock pot, add the turkey carcass and all the veggies. Pour in the water and the rice, and bring everything to a boil. Let it simmer for 90 minutes. Use tongs to remove any bones, etc. Season with salt, white pepper, and garnish with scallion and cilantro.",
        "1": "Now, that's the way we've always done it. But if you want a really smooth congee, you can do it a slightly different way. Rather than adding the rice to the pot at the beginning, simply add the carcass, vegetables, and water to the stock pot. Simmer for 2 hours until you have a rich stock.",
        "2": "Remove any large bones and then strain the stock into a clean pot. Add the rice, bring to a boil, and simmer for another 90 minutes. Stir in some leftover shredded turkey, season with salt and pepper, and garnish with scallions and cilantro."
    }, 
    "recipe_length": 3, 
    "credits": "The Woks of Life",
    "url": "https://thewoksoflife.com/leftover-thanksgiving-turkey-congee/#recipe"
},
{"id": "0gij1vo4dh", 
    "name": "Button Mushroom Soup", 
    "season": "Fall",
    "description": "I love mushrooms and I love mushroom soups. This one is a hit.",
    "score": 5,
    "vegetarian": true,
    "vegan": true,
    "ingredients": {
        "button mushrooms":"8 oz",
        "vegetable oil":"2 tbsp",
        "water":"4 c",
        "light soy sauce": "1 1/2 tsp",
        "cornstarch": "2 tbsp"
    },
    "recipe": {
        "0": "Wash the mushrooms clean of any dirt, and dry them thoroughly with a clean kitchen towel. Detach the stems (you will add them to the soup also).",
        "1": "Place a medium soup pot over medium high heat. When the pan is very hot, add the oil and mushrooms cup-side up in a single layer. (Add the stems in too to avoid waste.)",
        "2": "Reduce the heat to medium, and cook until the mushroom caps are browned, and each cup fills with liquid (that’s the juices in the mushroom seeping out!). Also check the stems for browning. Avoid stirring during this pan-frying process as it’s the key step to developing flavor for this soup. (You also want to keep the mushroom juices in the caps.)",
        "3": "When the mushrooms are nicely browned, add the water and light soy sauce. Bring to a boil. Cover and simmer for 5 minutes over medium low heat.",
        "4": "Add salt to taste, and stir in the cornstarch slurry (if using). Simmer the soup for 30 seconds until thickened.",
        "5": "Just before serving, add the cilantro and scallions. If you like cilantro (like me) this soup can take a lot of cilantro!"
    }, 
    "recipe_length": 6, 
    "credits": "The Woks of Life",
    "url": "https://thewoksoflife.com/chinese-button-mushroom-soup/#recipe"
},
{"id": "9w54wuoeiu", 
    "name": "Tom Yum Soup", 
    "season": "Summer",
    "description": "Honestly, could have this soup any time of the year. I'm not a huge fan of acidic soups though.",
    "score": 1,
    "vegetarian": true,
    "vegan": true,
    "ingredients": {
        "water":"3 c",
        "vegetable stock":"2 c",
        "lemongrass":"1 stalk",
        "shallots":"3",
        "cilantro stem":"1",
        "galangal ":"1 inch",
        "makrut lime leaves":"5",
        "Thai bird's eye chilies":"1-2",
        "oyster mushrooms":"4 oz",
        "sugar":"1 tsp",
        "Thai chili paste":"2 tsp",
        "fish sauce": "2 tbsp",
        "lime juice": "3 tbsp"
    },
    "recipe": {
        "0": "Add 3 cups of water, and bring to a simmer. Cover, and simmer for 10 minutes. Add the vegetable stock.",
        "1": "Take the lemongrass, and trim away the dry reedy bit about halfway up the stalk, and then trim the base. Peel the tough outer layers away to reveal the more tender center. Smash the lemon grass using a mallet or heavy rolling pin (one without handles).",
        "2": "Cut the smashed lemongrass stalk into 2-inch (5 cm) lengths, and add it to the broth in the wok. Also add the shallots, cilantro stem, galangal, lime leaves, and thai chilies.",
        "3": "Bring to a simmer, cover, and simmer for 10 minutes. After 10 minutes, you can remove the inedible herbs and aromatics from the pot using a fine-meshed strainer, but we like to leave them in, as is traditional in Thailand.",
        "4": "Add the mushrooms, and simmer for another 5 minutes. Stir in the sugar, Thai chili paste and fish sauce. Stir until the chili paste has fully dissolved in the soup.",
        "5": "Add the lime juice to your serving bowl, and ladle the hot tom yum soup into the bowl. (You don’t want to cook the lime juice. You want to preserve its fresh flavor. You also want to avoid putting large amounts of acidic lime juice into your wok, which can wear away the patina)."
    }, 
    "recipe_length": 6, 
    "credits": "The Woks of Life",
    "url": "https://thewoksoflife.com/tom-yum-soup/#recipe"
},
{"id": "afxcr56051", 
    "name": "Bitter Melon Soup with Pork Bones", 
    "season": "Winter",
    "description": "Classic comfort food. My mom made this a lot and I find myself craving it during cold days.",
    "score": 5,
    "vegetarian": false,
    "vegan": false,
    "ingredients": {
        "pearl barley":"2 oz",
        "meaty pork bone":"1 1/2 pounds",
        "dried jujubes":"2-3",
        "water": "8 c",
        "ginger": "4 slices",
        "bitter melon": "12 oz",
        "MSG": "to taste, optional"
    },
    "recipe": {
        "0": "Soak the pearl barley for at least 2 hours or overnight. Drain and set aside. Also soak the pork bones in cold water for 1-2 hours to purge them of impurities, changing the water once halfway through.",
        "1": "Rinse the pork bones clean, using your hands to scrub them of any impurities and bone spurs. Transfer to a deep stock pot with just enough water to submerge them. Bring to a boil, and boil for 1 minute. Remove from the heat, rinse the pork bones clean, discard the water, and rinse the soup pot clean.",
        "2": "Add the pork bones back to the stock pot, along with soaked barley, dates, 8 cups water and the ginger slices. Set over high heat, and bring to a boil. Once boiling, immediately turn the heat down to medium low, cover, and simmer for 2 hours.",
        "3": "While the soup is simmering, slice the bitter melon in half lengthwise. Use a spoon to scoop out the seeds and scrape away all of the white pith, which can be particularly bitter. Cut each half into large chunks. Set aside.",
        "4": "After 2 hours of simmering, skim the fat off the surface of the soup. Add the bitter melon, cover, and simmer for another 30 minutes. Add salt to taste before serving (you can also add MSG for extra oomph if desired—this is completely optional!). Serve with light soy sauce to dip the tender pork ribs into."
    }, 
    "recipe_length": 5, 
    "credits": "The Woks of Life",
    "url": "https://thewoksoflife.com/bitter-melon-soup-pork-bones/#recipe"
},
{"id": "j36rgitrgi", 
    "name": "Chinese chicken broth", 
    "season": "Any",
    "description": "It’s the perfect canvas for all the recipes on the blog that call for chicken stock, from soups to wontons and noodles. It will also up your game for stir-fries and braises! Unlike Western chicken stocks and broths, which use a mix of vegetables and herbs, this is a clear, pure-tasting Chinese chicken broth, flavored just with ginger and scallions.",
    "score": 5,
    "vegetarian": false,
    "vegan": false,
    "ingredients": {
        "chicken drumsticks":"2 1/2 pounds",
        "chicken bones":"8 oz",
        "ginger":"3 large slices",
        "scallions": "2 large",
        "water": "2 c"
    },
    "recipe": {
        "0": "Add the raw chicken drumsticks and bones, ginger, and scallions to your Instant Pot. Add 12 cups of water. (We have an 8 qt. Instant Pot. If yours is smaller, scale down the recipe accordingly. Make sure your liquid levels do not exceed the max-fill line.)",
        "1": "Seal the lid of your Instant Pot. Set it to manual high pressure for 45 minutes. Once it beeps, it’s on, but it will take about 15-20 minutes to come up to high pressure, in addition to the 45 minutes of cooking time.",
        "2": "When it’s done, allow the Instant Pot to release pressure naturally for at least 30 minutes and carefully turn the venting knob to “venting” to finish releasing pressure. Alternatively, just let the pressure release gradually until the float valve/pressure indicator drops.",
        "3": "When it’s safe to do so, carefully remove the lid. If you’re using the stock right away, carefully ladle the broth out to ensure it’s clear. If you’re planning on storing it, remove the chicken, let the broth cool, and let the sediment settle. Then transfer it to reusable freezer containers for later use.",
        "4": "The broth will last in the refrigerator for 3-4 days. Freeze for up to 6 months, though it tastes best when used within 3 months."
    }, 
    "recipe_length": 5, 
    "credits": "The Woks of Life",
    "url": "https://thewoksoflife.com/instant-pot-chinese-chicken-broth/#recipe"
},
{"id": "k3rz0izw6h", 
    "name": "Spiced Vegan Lentil Soup", 
    "season": "Winter",
    "description": "Better than I thought a vegan lentil soup would be. Complex for a soup though",
    "score": 3,
    "vegetarian": true,
    "vegan": true,
    "ingredients": {
        "extra virgin olive oil":"1/4 c",
        "onion":"1",
        "carrots":"2",
        "garlic":"4 cloves",
        "cumin":"2 tsp",
        "curry powder":"1 tsp",
        "dried thyme":"1/2 tsp",
        "tomatoes":"1 can",
        "lentils":"1 c",
        "vegetable broth":"4 c",
        "water":"2 c",
        "red pepper flakes":"pinch",
        "kale":"1 c",
        "lemon juice":"1-2 tbsp",
        "salt":"1 tsp"
    },
    "recipe": {
        "0": "Warm the olive oil in a large Dutch oven or pot over medium heat. One-fourth cup olive oil may seem like a lot, but it adds a lovely richness and heartiness to this nutritious soup.",
        "1": "Once the oil is shimmering, add the chopped onion and carrot and cook, stirring often, until the onion has softened and is turning translucent, about 5 minutes.",
        "2": "Add the garlic, cumin, curry powder and thyme. Cook until fragrant while stirring constantly, about 30 seconds. Pour in the drained diced tomatoes and cook for a few more minutes, stirring often, in order to enhance their flavor.",
        "3": "Pour in the lentils, broth and the water. Add 1 teaspoon salt and a pinch of red pepper flakes. Season generously with freshly ground black pepper. Raise heat and bring the mixture to a boil, then partially cover the pot and reduce the heat to maintain a gentle simmer. Cook for 25 to 30 minutes, or until the lentils are tender but still hold their shape.",
        "4": "Transfer 2 cups of the soup to a blender. Securely fasten the lid, protect your hand from steam with a tea towel placed over the lid, and purée the soup until smooth. Pour the puréed soup back into the pot. (Or, use an immersion blender to blend a portion of the soup.)",
        "5": "Add the chopped greens and cook for 5 more minutes, or until the greens have softened to your liking. Remove the pot from the heat and stir in 1 tablespoon of lemon juice. Taste and season with more salt, pepper and/or lemon juice until the flavors really sing. For spicier soup, add another pinch or two of red pepper flakes.",
        "6": "Serve while hot. Leftovers will keep well for about 4 days in the refrigerator, or can be frozen for several months (just defrost before serving)."
    }, 
    "recipe_length": 7, 
    "credits": "Cookie and Kate",
    "url": "https://cookieandkate.com/best-lentil-soup-recipe/"
},
{"id": "h4f8lh1kbe", 
    "name": "20-Minute Fish Congee", 
    "season": "Any",
    "description": "Congee is a great breakfast food in particular, as it’s popular at dim sum restaurants and Chinatown noodle soup spots. It’s warm, filling, and easy to digest. It’s also a great starter food for babies. ",
    "score": 1,
    "vegetarian": false,
    "vegan": false,
    "ingredients": {
        "white rice":"1 c",
        "delicate white fish filets":"12 oz",
        "oyster sauce":"2 tsp",
        "Shaoxing wine":"2 tsp",
        "ginger":"3 slices",
        "egg white":"1",
        "chicken broth":"4 c",
        "water ":"4 c",
        "romaine lettuce ":"2 c",
        "white pepper":"1/4 tsp",
        "salt ":"1/4 tsp"
    },
    "recipe": {
        "0": "Wash the rice 1-2 times, mixing it in the water with your hands before discarding the starchy water. Submerge and soak the rice for 30 minutes.",
        "1": "Drain and transfer to a resealable bag or other freezer-safe container. Freeze for at least 8 hours.",
        "2": "In a medium bowl, marinate the fish with salt, white pepper, oyster sauce, Shaoxing wine, and ginger. Use your hands to toss the fish to coat. Add the egg white, and gently mix until the marinade feels slippery and each fish chunk is well-coated.",
        "3": "Cover the bowl with an overturned plate and transfer to the refrigerator for 15 minutes to marinate while you start the congee.",
        "4": "In a large pot, bring 8-9 cups of stock and the frozen rice to a boil (no need to defrost the rice). Cover, leaving the lid slightly ajar to avoid the congee boiling over, and reduce the heat to medium low. Simmer for 10 minutes. Do not stir.",
        "5": "While the congee cooks, wash and finely chop the romaine lettuce and very thinly julienne the ginger. Don’t prepare the ginger ahead of time, as you want the flavor of freshly cut ginger.",
        "6": "After 10 minutes, increase the heat to medium high, and stir the congee continuously for a couple of minutes to thicken. Stir in the lettuce, and bring to a boil to wilt the lettuce.",
        "7": "Finally, add the fish pieces, gently stirring to distribute them. (If you don’t like the taste of raw ginger in your congee, you can add the ginger at this point, along with the fish fillets.) Bring to a boil, and add additional salt and white pepper to taste. Serve topped with scallions, cilantro, and ginger if desired."
    }, 
    "recipe_length": 8, 
    "credits": "The Woks of Life",
    "url": "https://thewoksoflife.com/fish-congee/#recipe"
},
{"id": "618honvp0t", 
    "name": "Seaweed egg drop soup", 
    "season": "Any",
    "description": "Common soup served with any meal, very versatile. Can be made with chicken stock, veggie stock, or water.",
    "score": 3,
    "vegetarian": true,
    "vegan": true,
    "ingredients": {
        "dried seaweed":"5 g",
        "vegetable stock":"4 c",
        "water ":"1 c",
        "sesame oil": "to taste",
        "white pepper": "1/4 tsp",
        "eggs": "2"
    },
    "recipe": {
        "0": "Toast the dried seaweed in a clean, dry wok over medium heat for 1-2 minutes on each side. Remove from the wok and set aside.",
        "1": "Add the stock and water to a wok or pot, and bring it to a boil. Add the dried shrimp flakes (if using), sesame oil, white pepper, and toasted seaweed. Stir and bring to a boil again.",
        "2": "With the stock boiling, stir in the beaten eggs, and then the chopped scallions. Bring to a boil once again, and serve immediately."
    }, 
    "recipe_length": 3, 
    "credits": "The Woks of Life",
    "url": "https://thewoksoflife.com/seaweed-egg-drop-soup/#recipe"
},
{"id": "n0z3fjok3p", 
    "name": "Chicken Noodle Wonton Soup", 
    "season": "Winter",
    "description": "Warm.",
    "score": 4,
    "vegetarian": false,
    "vegan": false,
    "ingredients": {
        "wontons":"as many as you want",
        "oil":"1 tbsp",
        "onion":"1/2",
        "carrots":"3",
        "celery":"3",
        "chicken broth":"5 c"
    },
    "recipe": {
        "0": "Make wontons or boil store-bought wontons.",
        "1": "With the wontons made, assemble the soup. This recipe uses just 5 cups of chicken broth with the expectation that you’ll freeze half of the wontons for another day. 5 cups of broth is enough for 4 servings.",
        "2": "Heat 1 tablespoon of oil in a soup pot. Sweat the onions until they’re translucent. Add the carrots and celery, and cook for about 2 minutes. Add the broth, and simmer, covered for about 20 minutes, until the vegetables are tender. Season with salt and pepper to taste.",
        "3": "Bring a separate pot of water to a boil for your wontons. Boil them for 5-6 minutes (for fresh wontons) or 7-8 minutes (for frozen wontons). Divide into bowls and top with the hot soup. "
    }, 
    "recipe_length": 4, 
    "credits": "The Woks of Life",
    "url": "https://thewoksoflife.com/chicken-noodle-wonton-soup/#recipe"
},
{"id": "d08zoz2jmx", 
    "name": "Asian Vegetable Stock", 
    "season": "Any",
    "description": "Great, versatile. A lot of work.",
    "score": 2,
    "vegetarian": true,
    "vegan": true,
    "ingredients": {
        "napa cabbage":"1/2",
        "vegetable oil":"2 tbsp",
        "ginger":"7 slices",
        "garlic":"2 cloves",
        "white fermented bean curd":"2 cubes",
        "onion":"1",
        "carrots":"1 pound",
        "scallions":"8",
        "daikon radish":"8 oz",
        "dried kelp (kombu)":"1 5x5 piece",
        "dried shiitake mushrooms":"16",
        "water ":"16 c"
    },
    "recipe": {
        "0": "Preheat oven to 375 degrees F. Take your napa cabbage half, and cut it in half again lengthwise. Place the cabbage on a sheet pan and drizzle lightly with oil. Roast for 25 minutes.",
        "1": "Meanwhile, in a large stockpot, heat 1 tablespoon oil over medium heat. Add the ginger and garlic and cook for 2 minutes, until fragrant but not browned. Add the fermented bean curd and cook for another minute. Then add the onion, carrots, scallions, daikon, kelp, dried shiitake mushrooms, and water. When the napa cabbage is done roasting, add it to the pot as well.",
        "2": "Bring to a boil, turn the heat down to low, and simmer with the lid on for 4 hours. Strain the stock, and season with salt to taste."
    }, 
    "recipe_length": 3, 
    "credits": "The Woks of Life",
    "url": "https://thewoksoflife.com/asian-vegetable-stock/#recipe"
},
{"id": "3t1u9l146c", 
    "name": "Laksa Noodle Soup", 
    "season": "Summer",
    "description": "Laksa is spicy, fragrant noodle soup found across Southeast Asia, particularly Singapore, Malaysia, and Indonesia. It consists of noodles (either wheat noodles, rice vermicelli, or egg noodles/hokkien noodles) in a thick broth made with spices, fresh aromatics, shrimp paste, and coconut milk. Common toppings include fried tofu puffs, fish cakes, blanched cockles, chicken, shrimp, minced laksa leaves, bean sprouts and other vegetables. This is delicious.",
    "score": 4,
    "vegetarian": false,
    "vegan": false,
    "ingredients": {
        "bone-in, skin-on chicken thighs":"4",
        "vegetable oil":"4 tbsp",
        "garlic":"1 clove",
        "ginger":"1 1/2 tbsp",
        "lemongrass":"1",
        "Thai chilies ":"2",
        "laksa paste":"1/2 c",
        "brown sugar":"1 tbsp",
        "chicken stock":"4 c",
        "coconut milk":"1 can",
        "fish sauce":"1 tbsp",
        "soy puffs":"1 package",
        "noodles":"4 portions",
        "limes ":"1-3",
        "shallots ":"3",
        "all purpose flour":"1/4 c",
        "shrimp":"12 large",
        "mung bean sprouts":"2 c"
    },
    "recipe": {
        "0": "Preheat your oven to 400 degrees F. Season the chicken thighs with salt and pepper (we used white pepper, but you can also use black pepper), and place on a baking sheet lined with parchment paper. Bake in the oven for 40 minutes. Remove from the oven and set aside.",
        "1": "While the chicken is cooking, heat 2 tablespoons vegetable oil in a large saucepan or medium pot over medium heat. Add the minced garlic and ginger and cook for 1 minute. Add the minced lemongrass and chilies, and cook for 3 minutes.",
        "2": "Add the laksa paste and brown sugar. Fry for another 3 minutes, letting all the flavors meld together. Add the chicken stock, coconut milk, and fish sauce. Bring to a boil. Add the soy puffs, cover, and allow to simmer for 10 minutes.",
        "3": "Meanwhile, rinse the noodles in warm water (for cooked hokkien noodles or rice vermicelli) or prepare according to package instructions (for fresh or dried wheat noodles). Distribute among four large noodle soup bowls.",
        "4": "Shred the cooked chicken and skin and distribute among the bowls. Pour any juices from the roasting pan into the broth. (You can even use a little bit of warm water to scrape any lingering tasty bits off the parchment paper).",
        "5": "Season the broth with lime juice and more fish sauce to taste, until your broth has reached your desired levels of saltiness/sourness. If you would rather not use fish sauce as your salting agent (it can be quite pungent to some palates), season with salt instead.",
        "6": "Meanwhile, toss the thinly sliced shallots in flour until they’re lightly coated. In a cast iron pan, heat an additional 2 tablespoons oil. Fry the shallots until crispy and set aside.",
        "7": "Season the shrimp with salt and pepper and sear them in the same oil you used to cook the shallots, just until they’re cooked through.",
        "8": "To assemble the laksa, pour the broth over the noodles and chicken, and add a couple pieces of soy puff to each. Top with the cooked shrimp, bean sprouts, cilantro, and fried shallots. Serve with extra lime wedges, and enjoy!"
    }, 
    "recipe_length": 9, 
    "credits": "The Woks of Life",
    "url": "https://thewoksoflife.com/laksa/#recipe"
},
{"id": "2o0464udbh", 
    "name": "Vegan Ramen Broth", 
    "season": "Any",
    "description": "Delicious but not the same as a ramen with char siu.",
    "score": 3,
    "vegetarian": true,
    "vegan": true,
    "ingredients": {
        "vegetable stock":"8 c",
        "spicy bean sauce ":"2 1/2 tsp",
        "white miso paste":"1 tbsp",
        "sesame oil":"1/2 tsp",
        "unsweetened soy milk":"1 1/2 c"
    },
    "recipe": {
        "0": "In a separate pot over medium heat, add a tablespoon of oil. Fry the spicy bean paste for 1 minute. Then strain the stock into the pot (you will need about 8 cups to make 4 bowls of ramen).",
        "1": "Add the miso paste and sesame oil, stirring until the miso paste is dissolved. Stir in the soy milk. Taste for seasoning and season with salt if desired. Keep over low heat (do not boil, or the soy milk will curdle), cover, and leave on the stove while you assemble the rest of the ingredients. "
    }, 
    "recipe_length": 2, 
    "credits": "The Woks of Life",
    "url": "https://thewoksoflife.com/vegan-ramen/#recipe"
},
{"id": "7gswuyl83q", 
    "name": "20-Minute Congee", 
    "season": "Any",
    "description": "Classic Chinese breakfast food. I love that I can make it in 20 minutes.",
    "score": 5,
    "vegetarian": true,
    "vegan": true,
    "ingredients": {
        "white rice":"3/4 c",
        "water":"7 c",
        "ginger":"3 slices",
        "ground white pepper":"1/4 tsp"
    },
    "recipe": {
        "0": "Wash the rice, drain, and transfer to a zip-loc bag or freezer-safe container. Leave it in the freezer for at least 8 hours.",
        "1": "Meanwhile, in a medium pot, bring 7 cups of water to a boil. Add the frozen rice (no need to defrost) and bring it to a boil again, stirring the rice to prevent sticking. Reduce the heat to a low simmer, and cover and cook for about 15 minutes. Periodically check and stir the congee. It’s important to stir from the bottom to prevent sticking, as the rice texture thickens quickly.",
        "2": "Stir and simmer for another 5 minutes or so. Finally, stir in the white pepper and salt to taste. Serve piping hot with chopped scallions and cilantro."
    }, 
    "recipe_length": 3, 
    "credits": "The Woks of Life",
    "url": "https://thewoksoflife.com/20-minute-congee-recipe/#recipe"
},
{"id": "qzaj663nzv", 
    "name": "Egg Drop Soup", 
    "season": "Winter",
    "description": "Making these soups during the winter months would help warm up the kitchen as we started our day, and, oftentimes, I would have a small cup of wonton soup broth or egg drop soup to start the day.",
    "score": 1,
    "vegetarian": true,
    "vegan": false,
    "ingredients": {
        "chicken stock ":"4 c",
        "sesame oil":"1/2 tsp",
        "salt":"3/4 tsp",
        "sugar":"1/8 tsp",
        "white pepper":"1/8 tsp",
        "turmeric":"1/2 tsp",
        "cornstarch":"3 tbsp",
        "eggs":"3"
    },
    "recipe": {
        "0": "Bring the chicken stock to a simmer in a medium soup pot. Stir in the sesame oil, salt, sugar, and white pepper. Add in the turmeric or 5 drops of yellow food coloring, if using. This will give the soup that rich restaurant-style yellow color, but it is optional. Taste the soup, and adjust the seasoning if needed.",
        "1": "Next add the cornstarch and water mixture. Make sure the cornstarch and water is mixed well, as the cornstarch settles very quickly. Stir the soup continuously as you drizzle in the slurry, or you'll get clumps of cooked starch in your soup. Use more or less starch if you like a thicker or thinner soup. You can also add the starch in a couple small batches, let the soup simmer for a couple of minutes, then check to see if the consistency is to your liking.",
        "2": "Now we're ready for the most exciting part: the egg. This recipe calls for the egg to be lightly beaten, which results in both white and yellow egg swirls. The speed at which you stir the soup when adding the egg also determines whether you get large “egg flowers” or small egg flowers (i.e. swirly bits of egg). Use a ladle to stir the soup in a circular motion, and slowly drizzle in the egg until you have added it all.",
        "3": "Ladle the soup into bowls, top with scallions, and serve!"
    }, 
    "recipe_length": 4, 
    "credits": "The Woks of Life",
    "url": "https://thewoksoflife.com/egg-drop-soup/#recipe"
},
{"id": "b5fverhtcn", 
    "name": "Black Sesame Tang Yuan", 
    "season": "Winter",
    "description": "Tang Yuan (汤圆) are a traditional sign of Chinese New Year, made with sweet and savory fillings. You’re probably most familiar with the sweet version of these round glutinous rice dumplings (the direct translation is “soup ball”), usually filled with sweet sesame paste, red bean paste, or sweet peanut paste, served in hot water or a light sweet soup.",
    "score": 5,
    "vegetarian": true,
    "vegan": true,
    "ingredients": {
        "roasted black sesame seeds":"2 oz",
        "caster sugar":"3 oz",
        "butter":"6 tbsp",
        "sweet rice flour": "1 c",
        "water": "1/2 c"
    },
    "recipe": {
        "0": "In a food processor or blender, finely grind the sesame seeds. Add the caster sugar and use a spatula to mix together in the food processor a bit. Then add the butter and pulse for 10 seconds at a time until the mixture is well combined. Scoop everything out into a bowl and put in the refrigerator for about 30 minutes. The purpose of this cooling process is to harden the mixture slightly for easy handling later.",
        "1": "While the filling is cooling, make the dough. Put the sweet rice flour into a mixing bowl. Slowly add in the warm water, while stirring to form a dough. The dough can’t be too wet, or it will not hold its shape. Cover with a damp towel.",
        "2": "Now boil some water in a small pot, take out a small piece of the dough, about 1” in diameter. Add it to the boiling water and cook the piece of dough until it floats. Scoop it out and add it to the rest of the dough. Mix the two parts together until the dough is soft and smooth. Divide the dough into 12 equal pieces (about 18 grams each, if you want to be really exacting), and roll them into balls. Keep the dough and dough balls covered with a damp paper towel while assembling.",
        "3": "Take out the filling after it’s cooled for 30 minutes. It should be slightly hard, but still workable. Roll the filling into small marble-sized balls, about 4 to 5 grams each. Then take each dough ball and flatten into a circle about 2 inches in diameter. Add the filling to the center, and close the dough over the filling. Roll the ball around in your hands until it’s smooth and round. Repeat until all the sesame balls are made. Cover the remaining filling and return to the refrigerator for later!",
        "4": "While you are assembling, bring a medium pot of water to a boil. Add the sesame balls and stir immediately to prevent them from sticking. Adding the sesame balls will cool down the water temperature significantly, so once the water comes back up to a boil, add a 1/2 cup of water to the pot. Repeat this step two more times. This cooking process will allow enough time for the sugar and butter to melt nicely into a smooth filling. Serve the sesame balls in a bit of the hot cooking water!"
    }, 
    "recipe_length": 5, 
    "credits": "The Woks of Life",
    "url": "https://thewoksoflife.com/tang-yuan-recipe/#recipe"
},
{"id": "568pa0upwq", 
    "name": "Taiwanese Beef Noodle Soup", 
    "season": "Summer",
    "description": "First, let’s talk about what Taiwanese Beef Noodle Soup is. It’s delicious. Tender beef, a rich and slightly spicy broth, fresh noodles, a little bok choy, and that absolutely necessary fistful of Chinese pickled mustard greens along with fresh scallions and cilantro.",
    "score": 5,
    "vegetarian": false,
    "vegan": false,
    "ingredients": {
        "star anise": "4",
        "Chinese cinnamon stick": "1",
        "bay leaves": "3",
        "fennel seeds": "1 tbsp",
        "cumin seeds": "1 tbsp",
        "coriander seeds": "1 tsp",
        "Sichuan peppercorns": "2 tbsp",
        "five spice powder": "1/4 tsp",
        "black pepper":"1/4 tsp",
        "beef shank": "3 pounds",
        "oil": "2 tbsp",
        "ginger": "2-inch piece",
        "garlic": "6 cloves",
        "scallions": "3",
        "onion": "1",
        "tomato": "1",
        "dried chilies": "1",
        "tomato paste": "1 tbsp",
        "spicy bean paste": "2 tbsp",
        "sugar": "2 tsp",
        "soy sauce": "1/2 c",
        "Shaoxing wine": "1/2 c",
        "water":"8 c",
        "bok choy":"small handful per serving",
        "fresh wheat noodles": "32 oz",
        "pickled mustard greens": "to taste"
    },
    "recipe": {
        "0": "Boil enough water in a pot to boil all of your beef. Once the water is boiling, add the beef. Let it come back up to a boil, and boil for 1 minute. Strain in a colander and rinse thoroughly with fresh water to remove any impurities.",
        "1": "Next, in your instant pot, turn on the saute setting. Add the oil, crushed ginger, garlic, scallions, and onions in that order. Stir to lightly caramelize. Let the onion turn translucent. Add the tomato and dried chilies.",
        "2": "Next, add the meat to the pot. Then add the tomato paste, spicy bean paste, sugar, soy sauce, and Shaoxing wine, and mix thoroughly.",
        "3": "Pour 8 cups of water into the instant pot. Add the spice packet. The instant pot should be filled to the 10-cup line; it shouldn’t be more than ⅔ of the way full per safety instructions. Our instant pot is the largest size (8 quarts); if yours is smaller, you can halve the recipe accordingly.",
        "4": "Close the lid of the instant pot, and make sure you have your vent set so it is not venting. Cook for 100 minutes on the Meat/Stew setting. If you don’t have an instant pot, you can use a regular pot on the stove, but instead, cook the soup on a low simmer for 3-4 hours.",
        "5": "When the instant pot timer is up, carefully release the pressure valve (wear an oven mitt, so you don’t scald yourself!). Boil some noodles per package instructions, and in the last minute or two of the noodles cooking, throw your bok choy in and blanch until just tender.",
        "6": "Serve each bowl of Taiwanese beef noodle soup with a serving of noodles, a few stalks of bok choy, and generous sprinklings of finely minced cilantro, scallions, and Chinese pickled mustard greens. Pro tip, buy the pre-seasoned spicy mustard greens and you can use them straight out of the package. If you are using the non-spicy version (from a can, for example), chop and saute with a little oil, a few chopped dried red chilies, and a pinch of sugar."
    }, 
    "recipe_length": 7, 
    "credits": "The Woks of Life",
    "url": "https://thewoksoflife.com/taiwanese-beef-noodle-soup-instant-pot/#recipe"
},
{"id": "qn56ol6fau", 
    "name": "Taiwanese Sesame Oil Chicken Soup", 
    "season": "Winter",
    "description": "This Taiwanese Sesame Oil Chicken Soup is like a miracle worker. All of the ingredients in this soup have “warming” properties that can supposedly improve blood circulation, warm up those icy hands and toes, and help ward away the chill during the long winter ahead.",
    "score": 4,
    "vegetarian": false,
    "vegan": false,
    "ingredients": {
        "chicken legs":"3 pounds",
        " black sesame oil":"3 tbsp",
        "ginger":"3 oz",
        "Taiwanese rice wine":"1 bottle",
        "rock sugar":"20 g",
        "water":"4 c"
    },
    "recipe": {
        "0": "Rinse your chicken and pat dry with a paper towel.",
        "1": "Heat your wok or thick-bottomed pot over high heat until it starts to smoke slightly. Turn down the heat to medium, and wait a couple of seconds. Then add the black sesame oil, along with the sliced ginger. Cook for 2 minutes.",
        "2": "Turn up the heat to high, and sear the chicken legs (in batches if needed) until browned on all sides. Once the chicken legs are nicely browned, turn the heat back down to medium and add in rice wine, rock sugar, and water.",
        "3": "Cover and simmer over medium heat for 30 mins. The soup should be bubbling, but not boiling. The idea here is to cook the chicken and intensify the soup’s flavor without cooking off the liquid.",
        "4": "The soup is ready once the chicken legs are tender. Season with salt to taste and garnish with scallions when serving."
    }, 
    "recipe_length": 5, 
    "credits": "The Woks of Life",
    "url": "https://thewoksoflife.com/taiwanese-sesame-oil-chicken-soup/#recipe"
},
{"id": "7ms9mct1ov", 
    "name": "Sweet red bean soup", 
    "season": "Summer",
    "description": "The soup is thick, sweet, and studded with tiny, ever so slightly chewy, clear tapioca pearls.",
    "score": 2,
    "vegetarian": true,
    "vegan": true,
    "ingredients": {
        "dried adzuki beans":"2 c",
        "water":"8 c",
        "sugar":"1/2 c",
        "orange zest":"1/4 tsp",
        "tapioca pearls":"2-3 tbsp"
    },
    "recipe": {
        "0": "First, rinse the beans under cold water. Then, soak the beans in water for at least 8 hours (overnight).",
        "1": "Drain the beans and transfer to a medium-sized pot. Add 6 cups of fresh water. Bring to a boil, then let simmer for 1 hour. Over the course of the hour, add an additional 2 cups of water as needed.",
        "2": "When the beans look soft and broken down, use an immersion blender to blend until the beans are just broken up--it shouldn’t be completely smooth (unless that’s your preference--you’re the cook here!). You can also transfer to a blender and pulse a few times until you achieve your desired consistency.",
        "3": "Transfer the blended mixture back to the pot. If you like a soupier consistency, feel free to add additional water at this stage until you reach your desired consistency. Add the sugar and orange zest. Stir over medium to medium-high heat to dissolve the sugar. The mixture should bubble very gently.",
        "4": "Next, add the tapioca. Cook for 20 minutes until the tapioca pearls become translucent. Some recipes recommend cooking the tapioca separately, but it works just fine to add them directly to the soup. When the tapioca pearls are totally translucent, it’s ready to serve!"
    }, 
    "recipe_length": 5, 
    "credits": "The Woks of Life",
    "url": "https://thewoksoflife.com/red-bean-soup/#recipe"
},
{"id": "vx4g66nscs", 
    "name": "Chinese Chicken Mushroom Soup", 
    "season": "Spring",
    "description": "The goal of this chicken mushroom soup recipe is to ensure the best of both worlds: delicious soup and juicy chicken that you can definitely serve up as a complete meal.",
    "score": 4,
    "vegetarian": false,
    "vegan": false,
    "ingredients": {
        "dried shiitake mushrooms":"20",
        "water ":"8 c",
        "dried goji berries":"2 tbsp",
        "dried Chinese dates":"4",
        "chicken":"1 whole",
        "oil":"1 tbsp",
        "ginger":"5 slices",
        "Shaoxing wine":"2 tbsp"
    },
    "recipe": {
        "0": "First, wash the dried shiitake mushrooms a couple of times and rinse thoroughly. Then soak them in 8 cups of water in the soup pot for 6 hours or overnight. Trim away the stems (after soaking) before cooking and add the mushrooms back to the pot of water.",
        "1": "Add the dried goji berries and dried Chinese dates to the soup pot (no need to soak these beforehand). Bring to a boil over high heat, and then immediately turn the heat down to low.",
        "2": "Prepare the chicken while that’s simmering. Wash the chicken and pat it dry with a paper towel. Trim and set aside the chicken breasts for another dish. Cut the rest of the chicken into large pieces. Set aside.",
        "3": "Once the soup has simmered for 30 minutes, heat a wok over medium high heat until it starts to smoke slightly. Turn the heat down to medium, and add the oil and the ginger slices. Cook for a minute or two.",
        "4": "Spread the oil around the wok to coat. Then spread the chicken out in a single layer, and lightly brown the chicken before stirring. Once the majority of each piece has been cooked through, turn off the heat.",
        "5": "Add the chicken to the soup pot. Deglaze the wok with ½ cup water, and add it to the soup pot as well. Finally, add the Shaoxing wine and cover. Simmer for another 30 minutes over medium heat. Add salt to taste and sprinkle with chopped scallions right before serving."
    }, 
    "recipe_length": 6, 
    "credits": "The Woks of Life",
    "url": "https://thewoksoflife.com/chinese-chicken-mushroom-soup/#recipe"
},
{"id": "yfgbsgub1r", 
    "name": "Savory Soy Milk Soup with Fried Dough", 
    "season": "Summer",
    "description": "This Savory Soy Milk Soup with Fried Dough, or Dou Jiang You Tiao, is a popular breakfast/brunch item in China. It’s the simplest thing you’ll ever make, after a quick trip to the Chinese grocery store. It’s basically a soy milk soup, curdled slightly with the vinegar, and flavored with scallions, sesame oil, pickled radishes and the crispy fried dough. Okay, so this dish isn’t out there winning any mainstream awards. But we used to go to this Shanghainese restaurant for Sunday brunch, and almost everyone in the restaurant made sure to order a bowl of dou jiang along with their scallion pancakes and soup dumplings.",
    "score": 2,
    "vegetarian": true,
    "vegan": true,
    "ingredients": {
        "Unsweetened soy milk":"to taste",
        "Chinese black vinegar":"to taste",
        "White pepper":"to taste",
        "Salt":"to taste",
        "Sesame oil":"to taste",
        "Chinese fried crullers":"toasted"
    },
    "recipe": {
        "0": "In a pot, heat up the soy milk. In a serving bowl, add a couple teaspoons vinegar, salt and white pepper to taste, a drizzle of sesame oil, and a couple teaspoons picked radish (you can adjust the quantities of all these ingredients according to your own taste). Pour in the hot soy milk and let stand for a minute, without stirring. Garnish with chopped scallion and fried dough. Serve!"
    }, 
    "recipe_length": 1, 
    "credits": "The Woks of Life",
    "url": "https://thewoksoflife.com/soy-milk-soup-w-fried-dough-dou-jiang/#recipe"
},
{"id": "fj9wccv2fb", 
    "name": "Noodle Soup with Pork and Pickled Greens", 
    "season": "Summer",
    "description": "This noodle soup with pork and pickled greens (xuecai rousi mian / 雪菜肉丝面）is one of my absolute favorites. It’s an easy, satisfying comfort food meal in Chinese households everywhere, where all you need is a few items from your pantry.",
    "score": 5,
    "vegetarian": false,
    "vegan": false,
    "ingredients": {
        "chicken stock":"4 c",
        "oil":"1 tbsp",
        "dried chilies ":"3-5",
        "pickled mustard greens": "1 can",
        "sugar": "1/4 tsp",
        "noodles": "8 oz",
        "sesame oil": "1 tsp"
    },
    "recipe": {
        "0": "In a small bowl, combine the pork, salt, cornstarch, sesame oil, shaoxing wine, and white pepper. Set aside to marinate while preparing other ingredients.",
        "1": "Bring a pot of water to a boil for your noodles, and cook the noodles according to package directions. Drain. In another medium pot, add your chicken stock and bring to a boil. Keep warm on the stove.",
        "2": "Heat a tablespoon of oil in your wok over high heat and brown the pork. Add the chilies and the pickled vegetables. Stir-fry for a couple minutes, making sure the heat is still high. Add the sugar, give everything a final stir, and turn off the heat.",
        "3": "Lay the noodles in your serving bowls and ladle in the hot broth. Top with your pork and vegetable mixture, and top each bowl with a few drops of sesame oil and chopped scallion."
    }, 
    "recipe_length": 4, 
    "credits": "The Woks of Life",
    "url": "https://thewoksoflife.com/noodle-soup-pork-pickled-greens/#recipe"
},
{"id": "b9yrybzm21", 
    "name": "Anchovy kelp stock", 
    "season": "Any",
    "description": "All cultures rely on stock to make their soups and stews delicious. Today I’m going to show you how to make a savory Korean stock that you can use as a base in many Korean dishes. It’s a typical Korean base for soups and stews like sundubu-jjigae (spicy soft tofu stew), and noodle soup (guksu) as well as any broth that needs a tasty boost, like tteokbokki (spicy rice cake). Of course Korean cuisine also uses beef and chicken stocks too, depending on the dish, but anchovy kelp stock is the most common and the one I like the best.",
    "score": 2,
    "vegetarian": false,
    "vegan": false,
    "ingredients": {
        "dried anchovies":"8 large",
        "dried kelp":"1/2 oz",
        "Korean radish ":"8 oz",
        "scallions": "2",
        "onion": "3 oz",
        "water": "12 c"
    },
    "recipe": {
        "0": "Heat a large pot over medium high heat and add the anchovies. Periodically stir with a wooden spoon and cook the anchovies for about 3 to 4 minutes until they smell a little nutty.",
        "1": "Remove from the heat. Add the radish, green onion, onion, dried kelp, and water. Cover and cook for 10 minutes.",
        "2": "Open and stir it a few times, then close. Lower the heat to medium and cook for another 30 minutes until the radish and onion turn translucent. If the radish is still not translucent after 30 minutes, add more water and cook a little longer.",
        "3": "Remove from the heat. Strain the stock over a large bowl. Discard the cooked ingredients except for the kelp. You will get about 9 to 10 cups stock, which you can use right away or freeze for up to 3 months."
    }, 
    "recipe_length": 4, 
    "credits": "Maangchi",
    "url": "https://www.maangchi.com/recipe/myeolchi-dasima-yuksu"
},
{"id": "lu0wsfrrl4", 
    "name": "Korean-style mapo tofu", 
    "season": "Winter",
    "description": "It’s a simple recipe but it looks so gorgeous when it’s placed on the dinner table! Of course it tastes so good, too: smooth tofu, firm pork bits, and vegetables with a generous amount of spicy and smoky saucy broth! Everybody at the table will be excited to scoop some of it and enjoy it mixed with warm rice!",
    "score": 5,
    "vegetarian": true,
    "vegan": true,
    "ingredients": {
        "vegetable oil":"3 tbsp",
        "garlic":"4",
        "ginger":"1",
        "gochugaru":"1 tbsp",
        "onion": "1",
        "mild green chili peppers": "2",
        "scallions":"8",
        "vegetable stock":"1 1/4 c",
        "gochujang":"2 tbsp",
        "soy sauce":"1 tbsp",
        "tofu":"1 pound",
        "potato starch":"1 tbsp",
        "toasted sesame oil":"1 tsp"
    },
    "recipe": {
        "0": "Heat up a large skillet or a pan over medium high heat. Add vegetable oil, garlic, and ginger, stirring with a wooden spoon for 1 to 2 minutes until the garlic turns light brown and crispy and the oil smells fragrant.",
        "1": "Stir in hot pepper flakes for about 30 seconds until it bubbles and smells a little smoky.",
        "2": "Add the onion, green chili pepper, and green onion. Stir for 1 minute until the vegetables turn slightly withered. Stir in soy sauce and hot pepper paste.",
        "3": "Add 1 cup broth and cook for about 2 minutes until vigorously boiling.",
        "4": "Add the tofu cubes and gently mix with a wooden spoon, careful not to break up the tofu. Cook for about 3 to 4 minutes until the tofu turns soft.",
        "5": "While the tofu is cooking, combine the rest of the ¼ cup chicken broth and potato starch in a small bowl and mix it well. Add it to the boiling mapo tofu and gently stir it in with a wooden spoon to thicken the sauce.",
        "6": "Remove from the heat and stir in the sesame oil. Transfer to a large shallow bowl. Serve with rice, kimchi, and a few more side dishes."
    }, 
    "recipe_length": 7, 
    "credits": "Maangchi",
    "url": "https://www.maangchi.com/recipe/korean-style-mapo-tofu"
},
{"id": "genbzdqzk3", 
    "name": "Fermented soybean paste stew", 
    "season": "Winter",
    "description": "When a Korean mom chooses the first real meal for her baby, she chooses doenjang-jjigae (or soup made with soybean paste, doenjang-guk) with fluffy white rice. To make it go down easy she mixes the stew with the rice and feeds it to her child. Years later, when the child is grown and living far away, she makes it for them whenever they come home again, because every child has ingrained memories of mom’s doenjang-jjigae. It’s something they know and love and are always comforted with.",
    "score": 4,
    "vegetarian": false,
    "vegan": false,
    "ingredients": {
        "potato":"1",
        "onion":"1",
        "zucchini":"1",
        "green Korean chili pepper (cheong-gochu)":"1",
        "garlic":"4",
        "shrimp":"4",
        "water":"2 1/2 c",
        "dried anchovies":"7",
        "fermented soybean paste (doenjang)":"5 tbsp",
        "tofu":"6 oz"
    },
    "recipe": {
        "0": "Combine the potato, onion, zucchini, chili pepper, garlic, and shrimp in a 1½-quart (6 cups) earthenware pot or other heavy pot.",
        "1": "Wrap the dried anchovies in cheesecloth (or a dashi bag, a pouch for stock-making sold at a Korean grocery store), and put them into the pot with other ingredients  Add water and cover.",
        "2": "Cook over medium-high heat for 15 minutes until it starts boiling. If you use a stainless steel pot, it will take less than 15 minutes, about 7 to 8 minutes.",
        "3": "Stir in the soybean paste, mixing well. Cover and cook for 20 minutes longer over medium heat.",
        "4": "Add the tofu and cook for another 3 minutes. Remove the anchovy pouch and discard.",
        "5": "Sprinkle with the green onions and serve as a side dish to rice. Serve it directly from the pot, or transfer to a serving bowl. Everybody can eat together out of the pot, or portions can be ladled out in individual bowls for each person."
    }, 
    "recipe_length": 6, 
    "credits": "Maangchi",
    "url": "https://www.maangchi.com/recipe/doenjang-jjigae"
},
{"id": "9g5vx19m1p", 
    "name": "Spicy soft tofu stew with kimchi and pork belly", 
    "season": "Winter",
    "description": "It’s hot, spicy, filling, comforting, delicious, soft tofu stew and has many reasons to be one of the most popular items in Korean restaurants.",
    "score": 4,
    "vegetarian": true,
    "vegan": false,
    "ingredients": {
        "dried anchovies":"8",
        "radish":"5 oz",
        "dried kelp":"1 6x4 piece",
        "gochugaru":"2 tbsp",
        "onion": "1/4 c",
        "pork belly": "1/2 c",
        "scallions":"1",
        "garlic":"1",
        "kimchi":"1/2 c",
        "sugar":"1 tsp",
        "salt":"1 tsp",
        "soft tofu":"1 tube",
        "egg": "1",
        "toasted sesame oil":"1 tsp",
        "vegetable oil": "1 tsp"
    },
    "recipe": {
        "0": "Put dried anchovies, radish, dried kelp, and 4 cups of water in a pot. Cover and boil over medium high heat for 10 minutes until it starts boiling.",
        "1": "Reduce the heat to low and boil another 20 minutes. Remove from the heat and strain. It will make about 2 cups of stock.",
        "2": "Combine the hot pepper flakes and the sesame oil in a small bowl and mix well.",
        "3": "Heat up a 3 cup earthenware pot (ttukbaegi) on the stove over medium high heat for about 3 to 4 minutes. If you use a small heavy pan or pot, it will take less.",
        "4": "Add the vegetable oil, onion, and garlic. Stir it with a wooden spoon for 1 minute. Add the pork. Stir for 3 minutes until the pork is no longer pink.",
        "5": "Add kimchi and keep stirring for a minute. Add ½ cup anchovy stock. Cover and cook for 7 minutes over medium heat.",
        "6": "Add the salt and the sugar and mix well. Cut the tube of soft tofu into half and squeeze it out into the pot. Gently break up the tofu with a wooden spoon. If you want, add a few tablespoons of stock.",
        "7": "Put the hot pepper mixture on top and spread it with the spoon.",
        "8": "Crack the egg and put it on top, in the center of the stew. Let it bubble and sizzle for 1 minute."
    }, 
    "recipe_length": 9, 
    "credits": "Maangchi",
    "url": "https://www.maangchi.com/recipe/sundubu-jjigae"
},
{"id": "0hwmoj22go", 
    "name": "Army Base Stew", 
    "season": "Fall",
    "description": "This dish was invented after the Korean war (1950-1953) when the American army was stationed in the city of Uijeongbu, near Seoul. They had their own food on the base, things like canned beans, meat, Spam, ham, and sausages. This food was totally new to Koreans. Eventually these ingredients made their way into surrounding area of the base and some creative Koreans made stew from them. They boiled spam, ham, sausages, and baked beans with kimchi, garlic, and hot pepper paste and flakes, creating a Korean-style stew with American ingredients.",
    "score": 2,
    "vegetarian": false,
    "vegan": false,
    "ingredients": {
        "dried shiitake mushrooms":"2",
        "dried anchovies":"8",
        "dried kelp ":"1 5x6 sheet",
        "water":"8 c",
        "salt":"1 tsp",
        "garlic":"6",
        "gochujang":"1 tbsp",
        "gochugaru":"2 tbsp",
        "soy sauce":"1 tsp",
        "sugar":"1 tsp",
        "pork belly":"1/2 pound",
        "noodles":"2 oz",
        "cabbage":"1 c",
        "onion":"1/2",
        "scallions":"2",
        "kimchi":"1/2 c",
        "Polish sausage":"4 oz",
        "spam":"4 oz",
        "instant ramen":"1 package",
        "radish sprouts":"1 c"
    },
    "recipe": {
        "0": "Combine the water, anchovies, mushrooms, and kelp in a large pot. Cover and cook for 25 minutes over medium high heat. Add the pork and cook for another 10 minutes.",
        "1": "Remove the pot from the heat. Take out the anchovies, kelp and mushrooms. Slice the mushrooms into bite size pieces. Strain the mixture of the stock and the pork into a large bowl. Put the pork into a small bowl. You will get about 6 cups of stock. Stir in the salt until dissolved.",
        "2": "Combine the seasoning paste ingredients – garlic, hot pepper paste, hot pepper flakes, soy sauce, sugar, and water in a bowl. Mix well.",
        "3": "Put the cabbage, onion, green onion, pork, and the mushrooms, on the bottom of the pot. Add the kimchi, and the seasoning paste over top. Add the spam, sausage, rice cake, tofu, baked beans, and cheese. Add the ramyeon and the sweet potato starch noodles.",
        "4": "Put radish sprouts on top and add 3 cups of stock.",
        "5": "Cook over medium high heat. Korean style is to cook at the table with a portable burner. Friends and family will be sitting around the pot, talking and laughing, and maybe drinking. You can take a bit of cooked sausage or the meat with your chopsticks as you wait for the broth to boil and the noodles to soften. If you don’t have a tabletop burner, you can cook it on the stove away from the table.",
        "6": "When it starts boiling about 10 minutes later, stir and turn the ingredients over with tongs to cook evenly. Serve right after the noodles and ramyeon have softened. Transfer some cooked stew to individual bowls and serve. Add more stock as the broth boils down."
    }, 
    "recipe_length": 7, 
    "credits": "Maangchi",
    "url": "https://www.maangchi.com/recipe/budae-jjigae"
},
{"id": "juza5l1kj6", 
    "name": "Kimchi stew", 
    "season": "Any",
    "description": "I learned this recipe from a restaurant famous for kimchi-jjigae in Korea. The restaurant was always full of people eating and sweating over kimchi stew.  There was only one item on the menu, so everyone was there for the same thing: a steaming pot of spicy kimchi-jjigae, a few side dishes, and a bowl of warm rice. Customers would call out: “Please give me another bowl of rice!”",
    "score": 5,
    "vegetarian": true,
    "vegan": true,
    "ingredients": {
        "kimchi":"1 pound",
        "kimchi brine":"1/4 c",
        "tofu":"1/2 package",
        "scallions":"3",
        "onion":"1",
        "salt":"1 tsp",
        "sugar":"2 tsp",
        "gochugaru":"2 tsp",
        "gochujang":"1 tbsp",
        "toasted sesame oil":"1 tsp",
        "stock": "2 c"
    },
    "recipe": {
        "0": "Place the kimchi and kimchi brine in a shallow pot. Add onion. Slice 2 green onions diagonally and add them to the pot.",
        "1": "Add salt, sugar, hot pepper flakes, and hot pepper paste. Drizzle sesame oil over top and add the anchovy stock",
        "2": "Cover and cook for 10 minutes over medium high heat.",
        "3": "Open and mix in the seasonings with a spoon. Lay the tofu over top. Cover and cook another 10 to 15 minutes over medium heat.",
        "4": "Chop 1 green onion and put it on the top of the stew. Remove from the heat and serve right away with rice."
    }, 
    "recipe_length": 5, 
    "credits": "Maangchi",
    "url": "https://www.maangchi.com/recipe/kimchi-jjigae"
}
]